[
  {
    "id": 1,
    "name": "Coahuilteco",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Wohngebiet_Coahuiltec.png/500px-Wohngebiet_Coahuiltec.png",
    "imgAlt": "A General region of where the Coahuilteco Tribe existed and spread there language",
    "description": "Coahuiltecan was a proposed language family in John Wesley Powell's 1891 classification of Native American languages."
  },
  {
    "id": 2,
    "name": "Toboso",
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/13/Tobosos.jpg",
    "imgAlt": "Image of the Toboso people.",
    "description": "In the seventeenth century the Toboso Indians occupied the Bolsón de Mapimí of Coahuila and Chihuahua, and in the following century they frequently raided Spanish settlements to the east in Nuevo León. It is likely that they sometimes crossed the Rio Grande, but records of Tobosos in Texas are rare. However, a few Toboso Indians found their way to Nuestra Señora del Refugio Mission near the Texas coast. Baptismal records indicate their presence at this mission between 1807 and 1828. The Tobosos are frequently identified as Athapaskans (Apaches), but more recent research has produced enough evidence to indicate that the Toboso language was probably Uto-Aztecan."
  },
  {
    "id": 3,
    "name": "Karankawa",
    "image": "https://www.tshaonline.org/images/handbook/entries/WW/weir-guadalupe-bay.jpg",
    "imgAlt": "Image of what the Karankawan tribe might have looked like",
    "description": "By the 1840s, the Karankawa, now exiled, split into two groups, one of which settled on Padre Island while the other fled into the Mexican state of Tamaulipas. In 1858, Mexican rancher Juan Nepomuceno Cortina led a group of Mexicans and Texan colonists against what was believed to be the Karankawa's last known refuge, killing many. By 1891, the Karankawa ceased to exist as a functioning tribe. Today, however, there are unrecognized tribes who claim Karankawa descent."
  },
  {
    "id": 4,
    "name": "Jumano",
    "image": "https://www.tshaonline.org/images/handbook/entries/JJ/jumano-map.jpg",
    "imgAlt": "Map of the original homeland of the Jumano people",
    "description": " Although they ranged over much of northern Mexico, New Mexico, and Texas, their most enduring territorial base was in central Texas between the lower Pecos River and the Colorado. The Jumanos were buffalo hunters and traders, and played an active role as middlemen between the Spanish colonies and various Indian tribes."
  },
  {
    "id": 5,
    "name": "Guamares",
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/ChichimecNations.png",
    "imgAlt": "map of different tribes that worked together including the Guamares",
    "description": "The Guamare people were an indigenous people of Mexico, who were established mostly in Guanajuato and at the border of Jalisco."
  },
  {
    "id": 6,
    "name": "Caxcán",
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Guerra_de_juchipila.jpg",
    "imgAlt": "Caxcan warriors battling against the Spaniards",
    "description": "Cazcan or Caxcan (Kaskán), was the language of the Caxcan, one of the Chichimeca peoples of Mexico."
  },
  {
    "id": 7,
    "name": "Tecuexe",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Tecuexe_Masks.JPG/500px-Tecuexe_Masks.JPG",
    "imgAlt": "Tecuexe Masks from a museum in Zacatecas, Mexico near la Quemada.",
    "description": "The Tecuexe language is now extinct and very little is known about it. It was likely a Uto-Aztecan language."
  },
  {
    "id": 8,
    "name": "Manso",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Nuestra_Senora_de_Guadalupe_de_los_Manso.jpg/500px-Nuestra_Senora_de_Guadalupe_de_los_Manso.jpg",
    "imgAlt": "The Mission to the Manso was established by Spanish missionaries in 1659. The mission built by the Manso still exists and is located in downtown Ciudad Juarez, Mexico.",
    "description": "Only a few words of their language were recorded, such as arre 'yes' (cf. Yaqui alla and Opata ore) and ocae 'arrow'."
  },
  {
    "id": 9,
    "name": "Cuitlatec",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRdsY-PsSmssvrotX6dhH6zhFBcoZqyH0-nog&s",
    "imgAlt": "Image of the last Cuitlateco Speakers",
    "description": "Cuitlatec, or Cuitlateco, is an extinct language isolate of Mexico, formerly spoken by an indigenous people known as Cuitlatec."
  },
  {
    "id": 9,
    "name": "Tepuztec",
    "image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1FziFr.img?w=768&h=768&m=6",
    "imgAlt": "Image of what looks like pottery from the Tepuztec",
    "description": "The name Tepuztec derives from the Nahuatl word tepoztli, meaning \"copper\" or \"workable metal\". The Tepuztec language is extinct and unclassified, no document describing it having been found. Donald Brand speculated that it was related to Cuitlatec given that both peoples originated on the Costa Grande."
  },
  {
    "id": 10,
    "name": "Cuyuteco",
    "image": "https://images.squarespace-cdn.com/content/v1/64cc9696adbf064fb79201c6/c19b2c95-e34c-4a0a-b7bc-e930cde95adb/Map+4.jpg?format=2500w",
    "imgAlt": "All towns that belonged to the Cututeco people are in clear Circles",
    "description": "The Cuyuteco people, also known as Cuyuteca, was a tribe of the Nahua culture, that lived primarily in the Pre-Columbian Mixtlán region of Xalisco, in the present day state of Jalisco in western central Mexico and along the Colima coastline."
  },
  {
    "id": 11,
    "name": "Totorame",
    "image": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Sinaloa_prehisp%C3%A1nica.jpg",
    "imgAlt": "Map of a bunch of tribs on the west coast of Mexico, where Totorame's trib is located at the very bottom of the image",
    "description": "The Totorame were a pre-Columbian indigenous people who inhabited the valley and coast from the Piaxtla River to the Cañas River, in what are now the municipalities of San Ignacio , Mazatlán , Concordia , Rosario , and Escuinapa in Sinaloa , extending to the Santiago River in the present-day state of Nayarit ."
  },
  {
    "id": 12,
    "name": "Xochimilco",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Lake_Texcoco_c_1519.png/500px-Lake_Texcoco_c_1519.png",
    "imgAlt": "Map of other tribs that could have spoken the original language of Nahuatl",
    "description": "Xochimilco was the most important city of the Xochimilca people, one of the Nahua tribes that migrated to the Mesoamerica region. At the same time it was the name of the altepetl of this group and historically referred to both interchangebly."
  },
  {
    "id": 13,
    "name": "Cholulteca",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Gran_Pir%C3%A1mide_de_Cholula%2C_Puebla%2C_M%C3%A9xico%2C_2013-10-12%2C_DD_10.JPG/500px-Gran_Pir%C3%A1mide_de_Cholula%2C_Puebla%2C_M%C3%A9xico%2C_2013-10-12%2C_DD_10.JPG",
    "imgAlt": "Pyramid of the Cholulteac people",
    "description": "The massacre of Cholula"
  },
  {
    "id": 14,
    "name": "Pochutec",
    "image": "https://figures.semanticscholar.org/021c3753f31be5e6c60e6e76f120fe06e2b85141/7-Figure4-1.png",
    "imgAlt": "Image of where Pochutec was spoken",
    "description": "Pochutec is an extinct Uto-Aztecan language of the Nahuan (or Aztecan) branch which was spoken in and around the town of Pochutla on the Pacific coast of Oaxaca, Mexico."
  },
  {
    "id": 15,
    "name": "Ch'olti’",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Palenque_glyphs-edit1.jpg/500px-Palenque_glyphs-edit1.jpg",
    "imgAlt": "Portion of a Mayan hieroglyphic text in Palenque",
    "description": "Chʼoltiʼ is a dead language belonging to the Ch’olan branch of the Mayan family of languages."
  },
  {
    "id": 16,
    "name": "Pericú",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/62/Pericu_map.png",
    "imgAlt": "Map where the Pericú people used to live",
    "description": "The Pericú language is extinct and unattested. Evidence concerning the language spoken by the Pericú is limited to a handful of words plus fewer than a dozen place names."
  },
  {
    "id": 17,
    "name": "Guaycura",
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/95/Guaycuras.png",
    "imgAlt": "Map of where the Guaycura used to live",
    "description": "The Guaycura language is attested by a few texts, but the evidence is not enough to classify it. It is not closely related to other known languages. Several businesses in Baja California Sur preserve the name of the Guaycura"
  },
  {
    "id": 18,
    "name": "Lost language of Teotihuacan",
    "image": "https://substackcdn.com/image/fetch/$s_!EVb8!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F67535db1-eab3-47f6-ac89-5ad5f62e5253_1280x698.jpeg",
    "imgAlt": "An image of Teotihuacan",
    "description": "While time has claimed much of the city, Teotihuacan’s colorful wall murals have endured. For decades, researchers have debated whether the artwork is only illustrative, or if they are linguistic representations. However, according to this new study, both answers are correct."
  },
  {
    "id": 19,
    "name": "Olmec",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Formative_Era_sites.svg/500px-Formative_Era_sites.svg.png",
    "imgAlt": "Area where the Olmec used to live",
    "description": "While the actual ethno-linguistic affiliation of the Olmec remains unknown, various hypotheses have been put forward. For example, in 1968 Michael D. Coe speculated that the Olmec were Maya predecessors."
  },
  {
    "id": 20,
    "name": "Chicomuceltec",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/UsumacintaYaxchilan16.JPG/500px-UsumacintaYaxchilan16.JPG",
    "imgAlt": "Image of Chapas Mexico, the area where Chicomuceltec was spoken",
    "description": "Chicomuceltec (also Chikomuselteko or Chicomucelteco; archaically, Cotoque) is a Mayan language formerly spoken in the region defined by the municipios of Chicomuselo, Mazapa de Madero, and Amatenango de la Frontera in Chiapas, Mexico, as well as some nearby areas of Guatemala. By the 1970s–80s it had become extinct, with recent reports in Mayanist literature finding that there are no living native speakers."
  },
  {
    "id": 21,
    "name": "Garza",
    "image": "https://i0.wp.com/ictnews.org/wp-content/uploads/2020/08/miakan-garza-band-dr-mario-garza-oct-19-2019.jpg?resize=780%2C520&quality=89&ssl=1",
    "imgAlt": "Present Day Grazan Tribe Leader",
    "description": "Garza, also called Meakán, is an extinct Comecrudan language of Texas and Mexico."
  },
  {
    "id": 22,
    "name": "Comecrudo",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Miterio_ipeki%C3%B3t_Reynosa_vautis%C3%A1ra.png/1280px-Miterio_ipeki%C3%B3t_Reynosa_vautis%C3%A1ra.png",
    "imgAlt": "Some words in Comecrudo",
    "description": "Comecrudo, also Yué, is an extinct Comecrudan language of Mexico."
  }
]